[
  {
    "id": 1,
    "name": "عنترة بن شداد",
    "full_name": "عنترة بن شداد العبسي",
    "birth_date": "525-01-01",
    "death_date": "608-01-01",
    "bio": "عنترة بن شداد شاعر وفارس جاهلي عربي من بني عبس. عرف بشجاعته وبطولاته في المعارك، ويعد من أبرز شعراء الجاهلية. كانت أشعاره تجمع بين الفروسية والحب لشاعرته عبلة، وقد ترك أثرًا كبيرًا في الشعر العربي الجاهلي من خلال المعلقات التي نظمها، والتي تتسم بالبلاغة والفخر والشجاعة.",
    "era": "العصر الجاهلي",
    "notable_works": ["معلقة عنترة بن شداد"]
  },
  {
    "id": 2,
    "name": "امرؤ القيس",
    "full_name": "امرؤ القيس بن حجر الكندي",
    "birth_date": "520-01-01",
    "death_date": "565-01-01",
    "bio": "امرؤ القيس شاعر جاهلي مشهور ومؤسس فن المعلقات، عرف بأسلوبه الشعري الرصين والمتنوع، حيث كتب عن الحب والطبيعة والفخر. تُعد أشعاره نموذجًا للبلاغة العربية الكلاسيكية، وقد أثر بشكل كبير على الشعراء اللاحقين في العصور الإسلامية والحديثة.",
    "era": "العصر الجاهلي",
    "notable_works": ["قف بالديار"]
  },
  {
    "id": 3,
    "name": "المتنبي",
    "full_name": "أبو الطيب المتنبي",
    "birth_date": "915-03-14",
    "death_date": "965-08-23",
    "bio": "المتنبي شاعر عباسي عربي يعتبر من أعظم شعراء العرب على الإطلاق. عُرف بفخره بنفسه وبقدرته على تصوير القوة والشجاعة والكرامة في أشعاره. كتب في الفخر، الهجاء، والحكمة، وله تأثير عميق على الشعر العربي الكلاسيكي والمعاصر. العديد من أبياته ما زالت تُدرس وتُستشهد بها حتى اليوم.",
    "era": "العصر العباسي",
    "notable_works": ["الخيل والليل والبيداء", "القصائد الفخرية"]
  },
  {
    "id": 4,
    "name": "ابن زريق البغدادي",
    "full_name": "ابن زريق البغدادي",
    "birth_date": "820-01-01",
    "death_date": "890-01-01",
    "bio": "ابن زريق البغدادي شاعر عباسي بارع، اشتهر بالغربة والفراق في أشعاره. تناول مواضيع الحنين إلى الوطن والحب المفقود بأسلوب رقيق ومؤثر. كانت له قدرة على التعبير عن المشاعر الإنسانية بطريقة متقنة تجمع بين الرقة والعمق.",
    "era": "العصر العباسي",
    "notable_works": ["قصيدة ابن زريق البغدادي"]
  },
  {
    "id": 5,
    "name": "كعب بن زهير",
    "full_name": "كعب بن زهير بن أبي سلمى",
    "birth_date": "550-01-01",
    "death_date": "658-01-01",
    "bio": "كعب بن زهير شاعر إسلامي، اشتهر بقصيدته 'بانت سعاد' التي اعتذر فيها للرسول صلى الله عليه وسلم بعد أن أساء إليه سابقًا. يعتبر أحد أبرز شعراء العصر الإسلامي المبكر، حيث جمع بين الرقة في المدح والحكمة في المعاني، وكان له تأثير كبير على الشعر الإسلامي الكلاسيكي.",
    "era": "العصر الإسلامي",
    "notable_works": ["بانت سعاد"]
  },
  {
    "id": 6,
    "name": "أبو القاسم الشابي",
    "full_name": "أبو القاسم الشابي",
    "birth_date": "1909-02-24",
    "death_date": "1934-10-09",
    "bio": "أبو القاسم الشابي شاعر تونسي من العصر الحديث، عرف بأشعاره الوطنية والإنسانية، وكتب عن الحرية والكرامة والحق في حياة الشعب. أشهر أشعاره 'إذا الشعب يوما أراد الحياة' أصبحت رمزًا للنضال والتحرر، وتأثر بها العديد من الثوار والمثقفين في العالم العربي.",
    "era": "العصر الحديث",
    "notable_works": ["إذا الشعب يوما أراد الحياة"]
  },
  {
    "id": 7,
    "name": "أبو فراس الحمداني",
    "full_name": "أبو فراس الحمداني",
    "birth_date": "932-09-20",
    "death_date": "968-06-03",
    "bio": "أبو فراس الحمداني شاعر عباسي وفارس عربي، اشتهر بأشعاره الغرامية والوطنية والحماسية، وقد كتب كثيرًا عن الحب والشكوى والشجاعة. كان من أبرز شعراء الدولة العباسية وترك أثرًا واضحًا في الشعر العربي الكلاسيكي.",
    "era": "العصر العباسي",
    "notable_works": ["أراك عصي الدمع"]
  },
  {
    "id": 8,
    "name": "إبراهيم ناجي",
    "full_name": "إبراهيم ناجي",
    "birth_date": "1898-01-01",
    "death_date": "1953-01-01",
    "bio": "شاعر مصري من العصر الحديث، عرف بأسلوبه الرومانسي والعاطفي. كتب في الحب والحنين والجمال، وكان له تأثير كبير على الشعر المصري الحديث، وترك العديد من القصائد التي تجمع بين الرقة والخيال والإحساس المرهف.",
    "era": "العصر الحديث",
    "notable_works": ["الأطلال"]
  },
  {
    "id": 9,
    "name": "جبران خليل جبران",
    "full_name": "جبران خليل جبران",
    "birth_date": "1883-01-06",
    "death_date": "1931-04-10",
    "bio": "شاعر وفنان لبناني أمريكي من العصر الحديث، كتب عن الحب والحياة والفلسفة والإنسانية. أشهر أعماله 'النبي' التي ترجمت إلى العديد من اللغات، وتجمع بين الشعر والنثر الفلسفي، ويعتبر أحد أبرز شعراء العرب والكتاب العالميين.",
    "era": "العصر الحديث",
    "notable_works": ["النبي"]
  },
  {
    "id": 10,
    "name": "محمد مهدي الجواهري",
    "full_name": "محمد مهدي الجواهري",
    "birth_date": "1899-06-06",
    "death_date": "1997-12-01",
    "bio": "شاعر عراقي معاصر من العصر الحديث، عرف بأشعاره الوطنية والسياسية، واحتلت مكانته بين كبار شعراء العرب في القرن العشرين. كتب في الفخر والحب والوطن والحرية، وتميز بلغة قوية وأسلوب متين ومؤثر.",
    "era": "العصر الحديث",
    "notable_works": ["قصائد وطنية"]
  }
]
